app/controllers/administrator/projects_controller.rb

	def index
		@projects = Project.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "projects".* FROM "projects" LIMIT 10 OFFSET 0

	def edit
		@project = Project.find(params[:id])
    @project_attachments = ProjectAttacment.where(project_id: @project.id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT "project_attacments".* FROM "project_attacments" WHERE "project_attacments"."project_id" = ?  [["project_id", 1]]

  def update
    @project = Project.find(params[:id])
    @project.assign_attributes(project_params)

    unless @project.valid?
    Rails.logger.debug @project.errors.full_messages
    end

    respond_to do |format|
      if @project.save
        if params[:images]
          params[:images].each { |image|
           ProjectAttacment.create(project_id: @project.id, image: image, place: params['place'])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "project_attacments" ("project_id", "image", "place", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["project_id", 1], ["image", "wallpaper__77_.jpg"], ["place", "Lisbon"], ["created_at", "2015-05-19 05:03:29.859879"], ["updated_at", "2015-05-19 05:03:29.859879"]]