app/controllers/static_controller.rb

	def home

		@slider = Slider.first
---
SELECT  "sliders".* FROM "sliders"  ORDER BY "sliders"."id" ASC LIMIT 1